"""Напишите программу, которая считывает целое число и выводит текст, аналогичный приведенному в примере (пробелы важны!)"""

s = int(input("Введите число: "))

x = s + 1
v = s - 1

print("Следующее число после", s, "будет", x)
print("преведущее число", s, "будет", v)