"""Дано 10 целых чисел.
Вычислите их сумму.
Напишите программу, использующую наименьшее число переменных."""

lis = [24, 35, 56, 43, 11, 105, 3, 8, 30, 29]

print(sum(lis))






