"""Напишите программу, которая считывает длины двух катетов в прямоугольном треугольнике и выводит его площадь.
    Каждое число записано в отдельной строке."""

h = int(input("введите высоту треугольника: "))
a = int(input("введите основание треугольника треугольника: "))

print(0.5*h*a)



