"""Условие   «Hello, Harry!»
Напишите программу, которая приветствует пользователя, выводя слово Hello, введенное имя и знаки препинания по образцу:"""

z = str(input("Введите имя: "))
print("Hello " + z + "!")