"""Даны два целых числа. Выведите значение наименьшего из них."""

a = int(input("Число 1: "))
b = int(input("Число 2: "))


if a < b:
    print(a)
else:
    print(b)

    